//
//  AzkarAlSabah.swift
//  AzkarAlMuslim
//
//  Created by Ahmed Elbasha on 11/30/18.
//  Copyright © 2018 Ahmed Elbasha. All rights reserved.
//

import UIKit

var azkarAlSabah = [Zekr(zekrName: "الحمد لله وحده، و الصلاة و السلام على من لا نبي بعده", tasbeehTarget: 1),
Zekr(zekrName: "الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السموات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين ايديهم و ما خلفهم  ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات و الأرض ولا يؤوده حفظهما وهو العلي العظيم", tasbeehTarget: 1),
Zekr(zekrName: "قل هو الله أحد. الله الصمد. لم يلد و لم يولد. و لم يكن له كفوا آحد", tasbeehTarget: 3),
Zekr(zekrName: "قل أعوذ برب الفلق. من شر ما خلق. و من شر غاسق إذا وقب . و من شر النفاثات  في العقد. و من شر حاسد إذا حسد", tasbeehTarget: 3),
Zekr(zekrName: " قل أعوذ برب الناس. ملك الناس. إله الناس. من شر الوسواس الخناس. الذي يوسوس في صدور الناس. من الجنة و الناس", tasbeehTarget: 3),
Zekr(zekrName: "أصبحنا و آصبح الملك لله، و الحمد لله، لا إله إلا الله وحده لا شريك له. له الملك و له الحمد و هو على كل شيء قدير. رب أسألك خير ما في هذا اليوم و خير ما بعده. و أعوذ بك من شر ما في هذا اليوم و شر ما بعده. رب أعوذ بك من الكسل و سوء الكبر . رب أعوذ بك من عذاب في النار و عذاب في القبر", tasbeehTarget: 1),
Zekr(zekrName: "اللهم بك أصبحنا و بك أمسينا و بك نحيا و بك نموت و إليك النشور ", tasbeehTarget: 1 ),
Zekr(zekrName: "اللهم ", tasbeehTarget: 1)]
