//
//  AzkarCategories.swift
//  AzkarAlMuslim
//
//  Created by Ahmed Elbasha on 11/30/18.
//  Copyright © 2018 Ahmed Elbasha. All rights reserved.
//

import UIKit

//var azkarCategories = ["دعاء الأستيقاظ من النوم", "دعاء لبس الثوب", "دعاء لبس الثوب الجديد", "الدعاء لمن لبس ثوبا جديدا", "ما يقول إذا وضع ثوبه", "دعاء دخول الخلاء", "دعاء الخروج من الخلاء", "الذكر قبل الوضوء", "الذكر بعد الفراغ من الوضوء", "الذكر عند الخروج من المنزل", "الذكر عند دخول المنزل", "دعاء الذهاب إلى المسجد", "دعاء دخول المسجد", "دعاء الخروج من المسجد", "أذكار آذكار الأذان", "دعاء الأستفتاح", "دعاء الركوع", "دعاء الرفع من الركوع", "دعاء السجود", "دعاء الجلسة بين السجدتين", "دعاء سجود التلاوة", "التشهد", "الصلاة على النبي صلى الله عليه و سلم", "الدعاء بعد التشهد الآخير قبل السلام", "الآذكار بعد السلام من الصلاة""]

