//
//  AzkarAlSabah.swift
//  AzkarAlMuslim
//
//  Created by Ahmed Elbasha on 11/30/18.
//  Copyright © 2018 Ahmed Elbasha. All rights reserved.
//

import UIKit

var azkarAlSabah = [Zekr(zekrName: "الحمد لله وحده، و الصلاة و السلام على من لا نبي بعده", tasbeehTarget: 1),
Zekr(zekrName: "الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السموات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين ايديهم و ما خلفهم  ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات و الأرض ولا يؤوده حفظهما وهو العلي العظيم", tasbeehTarget: 1),
Zekr(zekrName: "قل هو الله أحد. الله الصمد. لم يلد و لم يولد. و لم يكن له كفوا آحد", tasbeehTarget: 3),
Zekr(zekrName: "قل أعوذ برب الفلق. من شر ما خلق. و من شر غاسق إذا وقب . و من شر النفاثات  في العقد. و من شر حاسد إذا حسد", tasbeehTarget: 3),
Zekr(zekrName: " قل أعوذ برب الناس. ملك الناس. إله الناس. من شر الوسواس الخناس. الذي يوسوس في صدور الناس. من الجنة و الناس", tasbeehTarget: 3),
Zekr(zekrName: "أصبحنا و آصبح الملك لله، و الحمد لله، لا إله إلا الله وحده لا شريك له. له الملك و له الحمد و هو على كل شيء قدير. رب أسألك خير ما في هذا اليوم و خير ما بعده. و أعوذ بك من شر ما في هذا اليوم و شر ما بعده. رب أعوذ بك من الكسل و سوء الكبر . رب أعوذ بك من عذاب في النار و عذاب في القبر", tasbeehTarget: 1),
Zekr(zekrName: "اللهم بك أصبحنا و بك أمسينا و بك نحيا و بك نموت و إليك النشور ", tasbeehTarget: 1 ),
Zekr(zekrName: "اللهم أنت ربي لا إله إلا آنت، خلقتني و أنا عبدك و أنا على عهدك و وعدك ما استطعت أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، و أبوء بذنبي فأغفر لي فإنه لا يغفر الذنوب إلا أنت", tasbeehTarget: 1),
Zekr(zekrName: "اللهم إني أصبحت أشهدك و أشهد حملة عرشك ، و ملائكتك، و جميع خلقك، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك، و أن محمدآ عبدك و رسولك", tasbeehTarget: 4),
Zekr(zekrName: "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد و لك الشكر", tasbeehTarget: 1),
Zekr(zekrName: "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم إني أعوذ بك من الكفر، و الفقر، و أعوذ بك من عذاب القبر، لا إله إلا أنت", tasbeehTarget: 3),
Zekr(zekrName: "حسبي الله لا إله إلا هو عليه توكلت و هو رب العرش العظيم", tasbeehTarget: 7),
Zekr(zekrName: "اللهم إني أسألك العفو و العافية في الدنيا و الأخرة، اللهم إني أسألك العفو و العافية في ديني و دنياي و أهلي و مالي، اللهم استر عوراتي و آمن روعاتي، اللهم احفظني من بين يدي و من خلفي و عن يميني و عن شمالي و من فوقي و أعوذ بعظمتك آن أغتال من تحتي", tasbeehTarget: 1),
Zekr(zekrName: "اللهم عالم الغيب و الشهادة فاطر السماوات و الأرض، رب كل شيء و مليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي، و من شر الشيطان و شركه، و أن آقترف على نفسي سوءآ، أو أجره إلى مسلم", tasbeehTarget: 1),
Zekr(zekrName: "بسم الله الذي لا يضر مع أسمه شيء في الأرض ولا في السماء و هو السميع العليم", tasbeehTarget: 3),
Zekr(zekrName: "رضيت بالله ربآ، وبالأسلام دينا، و بمحمد صلى الله عليه و سلم نبيآ", tasbeehTarget: 3),
Zekr(zekrName: "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين", tasbeehTarget: 1),
Zekr(zekrName: "أصبحنا و أصبح الملك لله رب العالمين، اللهم أني أسألك خير هذا اليوم فتحه و نصره و نوره و بركته و هداه، وأعوذ بك من شر ما فيه و شر ما بعده", tasbeehTarget: 1),
Zekr(zekrName: "أصبحنا على فطرة الأسلام، و على كلمة الأخلاص، و على دين نبينا محمد صلى الله عليه و سلم، و على ملة أبينا إبراهيم حنيفا مسلما و ما كان من المشركين", tasbeehTarget: 1),
Zekr(zekrName: "سبحان الله و بحمده", tasbeehTarget: 100),
Zekr(zekrName: "لا إله إلا الله وحده لا شريك له، له الملك و له الحمد وهو على كل شيء قدير", tasbeehTarget: 10),
Zekr(zekrName: "لا إله إلا الله وحده لا شريك له، له الملك و له الحمد وهو على كل شيء قدير", tasbeehTarget: 100),
Zekr(zekrName: "سبحان الله و بحمده، عدد خلقه و رضا نفسه، و زنة عرشه و مداد كلماته", tasbeehTarget: 3),
Zekr(zekrName: "اللهم إني أسألك علمآ نافعا، و رزقا طيبا، و عملآ متقبلآ ", tasbeehTarget: 1),
Zekr(zekrName: "أستغفر الله و أتوب إليه", tasbeehTarget: 100),
Zekr(zekrName: "اللهم صلي و سلم على نبينا محمد", tasbeehTarget: 10)]
